In [46]:
import pandas as pd
import numpy as np
import tensorflow as tf
import matplotlib.pyplot as plt

# Create a sample DataFrame
data = {
    'id': [1, 2, 3, 4],
    'name': ['John Smith', 'Jane Doe', 'Bob Johnson', 'Alice Brown'],
    'age': [28, 35, 42, 29],
    'salary': [50000, 70000, 90000, 55000]
}
pd.DataFrame(data)
# df.info()
# df.describe()

   id         name  age  salary
0   1   John Smith   28   50000
1   2     Jane Doe   35   70000
2   3  Bob Johnson   42   90000
3   4  Alice Brown   29   55000

In [22]:
mean1  =df['age'].mean()
mean1

# df.median() #median of data
# df.mode() #mode of data
# df.std() #stanndard deviation of data
# df.corr() #correlation of data

33.5

In [38]:
df.groupby('salary').groups
df.groupby('age').groups

{28: [0], 29: [3], 35: [1], 42: [2]}

In [34]:
df.groupby(['age', 'salary']).sum()

            id         name
age salary
28  50000    1   John Smith
29  55000    4  Alice Brown
35  70000    2     Jane Doe
42  90000    3  Bob Johnson

In [44]:
import pandas as pd

# Sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Alice', 'Charlie', 'David'],
        'Year': [2010, 2010, 2010, 2010, 2011, 2011, 2011],
        'Sales': [100, 200, 300, 400, 500, 600, 700]}
df = pd.DataFrame(data)

# Apply pivot_table() method to create a summary table
summary_table = pd.pivot_table(df, values='Sales', index='Name', columns='Year', aggfunc='sum')

# Print the summary table
print(summary_table)

Year      2010   2011
Name
Alice    100.0  500.0
Bob      200.0    NaN
Charlie  300.0  600.0
David    400.0  700.0